app/views/tickets/_actions.html.erb


	    <% Ticket.list_category_for_select.each do |group| %>
---
SELECT `tickets`.* FROM `tickets` ORDER BY tickets.number DESC LIMIT 1