app/controllers/piping_controller.rb

  def units_for_measure
  	records = UnitForMeasure.find(:all, :order => "name ASC")
    count =  records.size
---
SELECT `unit_for_measures`.* FROM `unit_for_measures` ORDER BY name ASC

  def piping_sizes
  	records = PipingSize.find(:all, :order => "piping_size ASC")
    count =  records.size
---
SELECT `piping_sizes`.* FROM `piping_sizes` ORDER BY piping_size ASC