app/controllers/reference_number_types_controller.rb

SELECT `reference_number_types`.* FROM `reference_number_types` ORDER BY order_number ASC
---
	def index
		@types = ReferenceNumberType.find(:all, :order => 'order_number ASC')
		respond_to do |format|
			format.html { render :index }
			format.json {
				records = @types.map {|t| t.sext_data }