app/controllers/tickets_controller.rb

  def create
    @ticket = Ticket.new(params[:ticket])

    respond_to do |format|
      if @ticket.save
---
INSERT INTO `tickets` (`assigned_to`, `attachment_content_type`, `attachment_file_name`, `attachment_file_size`, `attachment_updated_at`, `body`, `category`, `context`, `created_at`, `number`, `priority`, `reported_by`, `response`, `state`, `title`, `updated_at`) VALUES (NULL, NULL, NULL, NULL, NULL, 'test', 'Bug', 'POPV', '2013-01-23 11:52:17', 24, 'Low', 'maisa', NULL, 'New', 'test', '2013-01-23 11:52:17')